#+TITLE: April 6-18, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO                                       | NEXT | IN_PROGRESS                                     | WAITING | DONE                                                         | CANCELED |
|--------------------------------------------+------+-------------------------------------------------+---------+--------------------------------------------------------------+----------|
| READ.1554709804. Read Linux for you and me |      | READ.1553531542. Data Structure and Algorithmic |         | READ.1553004553. The Hitchhiker's guide to Pyth (2019-04-18) |          |
| WRITE.1539072660. Blog                     |      | READ.1552291497. NIOS Maths Text Book - Part V  |         | READ.1555009355. Cloud Native DevOps with Kuber (2019-04-18) |          |
|                                            |      | DEV.1552226887. Stacknews                       |         | READ.1553531073. Read Kubernetes Docs (2019-04-18)           |          |
|                                            |      | READ.1554403369. Sapiens Book Reading           |         | READ.1553605019. Learn dgplug logs (2019-04-17)              |          |
|                                            |      | READ.1554709767. Learn Javascript               |         |                                                              |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED |             ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+--------------------+------+-----------+--------------+------------|
| Sidntrivedi   |        13 |               1.17 |    0 |        13 |   2019-05-07 | ---------- |
| Sandeepk      |      15.5 | 11.129999999999999 |    0 |      15.5 |   2019-05-07 | ---------- |
| Jasonbraganza |        39 |               5.95 |    0 |        39 |   2019-05-07 | ---------- |
| Gandalfdwite  |        22 |              23.72 |   17 |         5 |   2019-04-23 | ########-- |
| Bhavin192     |        13 |              10.67 |   13 |         0 |   2019-04-18 | ########## |
| Akshay196     |        13 |              10.78 |   13 |         0 |   2019-04-18 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                 |
|-----+------------+--------+-------+-------------------------------------------------|
|   1 | 2019-04-06 |  115.5 |   107 |                                                 |
|   2 | 2019-04-07 |  115.5 |    98 |                                                 |
|   3 | 2019-04-08 |  115.5 |    89 |                                                 |
|   4 | 2019-04-09 |  115.5 |    80 |                                                 |
|   5 | 2019-04-10 |  115.5 |    71 |                                                 |
|   6 | 2019-04-11 |  115.5 |    62 |                                                 |
|   7 | 2019-04-12 |  115.5 |    53 |                                                 |
|   8 | 2019-04-13 |  115.5 |    44 |                                                 |
|   9 | 2019-04-14 |  115.5 |    36 |                                                 |
|  10 | 2019-04-15 |  115.5 |    27 |                                                 |
|  11 | 2019-04-16 |  115.5 |    18 |                                                 |
|  12 | 2019-04-17 |  108.5 |     9 | READ.1553605019                                 |
|  13 | 2019-04-18 |   72.5 |     0 | READ.1553531073 READ.1555009355 READ.1553004553 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                                         | TASKID           | OWNER         | PRIORITY | TODO        | ESTIMATED |             ACTUAL |
|------------------------------------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------------------|
| TASKS                                                                        |                  |               | B        |             |     115.5 |              63.42 |
|------------------------------------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------------------|
| akshay196                                                                    |                  |               | B        |             |        13 |              10.78 |
| The Hitchhiker's guide to Python - Part II                                   | READ.1553004553  | akshay196     | B        | DONE        |        13 |              10.78 |
|------------------------------------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------------------|
| bhavin192                                                                    |                  |               | B        |             |        13 |              10.67 |
| Cloud Native DevOps with Kubernetes - Part I                                 | READ.1555009355  | bhavin192     | B        | DONE        |        13 |              10.67 |
|------------------------------------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------------------|
| gandalfdwite                                                                 |                  |               | B        |             |        22 |              23.72 |
| Read Kubernetes Docs                                                         | READ.1553531073  | gandalfdwite  | B        | DONE        |        10 |              14.30 |
| Learn dgplug logs                                                            | READ.1553605019  | gandalfdwite  | B        | DONE        |         7 |               7.60 |
| Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi) | READ.1553531542  | gandalfdwite  | B        | IN_PROGRESS |         5 |               1.82 |
|------------------------------------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------------------|
| jasonbraganza                                                                |                  |               | B        |             |        39 |               5.95 |
| NIOS Maths Text Book - Part V                                                | READ.1552291497  | jasonbraganza | B        | IN_PROGRESS |        39 |               5.95 |
|------------------------------------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------------------|
| sandeepk                                                                     |                  |               | B        |             |      15.5 | 11.129999999999999 |
| Stacknews                                                                    | DEV.1552226887   | sandeepk      | B        | IN_PROGRESS |         9 |               6.63 |
| Sapiens Book Reading                                                         | READ.1554403369  | sandeepk      | B        | IN_PROGRESS |       6.5 |               4.50 |
|------------------------------------------------------------------------------+------------------+---------------+----------+-------------+-----------+--------------------|
| sidntrivedi                                                                  |                  |               | B        |             |        13 |               1.17 |
| Learn Javascript                                                             | READ.1554709767  | sidntrivedi   | B        | IN_PROGRESS |         6 |               1.17 |
| Read Linux for you and me                                                    | READ.1554709804  | sidntrivedi   | B        | TODO        |         5 |                    |
| Blog                                                                         | WRITE.1539072660 | sidntrivedi   | B        | TODO        |         2 |                    |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-04-06 Sat>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 2
  :wpd-jasonbraganza: 3
  :wpd-sandeepk: 1.2
  :wpd-sidntrivedi: 1
  :END:
** akshay196
*** DONE The Hitchhiker's guide to Python - Part II [4/4]
    CLOSED: [2019-04-18 Thu 20:03]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:   10.78
    :OWNER: akshay196
    :ID: READ.1553004553
    :TASKID: READ.1553004553
    :END:
    :LOGBOOK:
    CLOCK: [2019-04-18 Thu 19:10]--[2019-04-18 Thu 20:02] =>  0:52
    CLOCK: [2019-04-17 Wed 19:14]--[2019-04-17 Wed 20:15] =>  1:01
    CLOCK: [2019-04-16 Tue 18:39]--[2019-04-16 Tue 19:35] =>  0:56
    CLOCK: [2019-04-15 Mon 18:52]--[2019-04-15 Mon 20:08] =>  1:16
    CLOCK: [2019-04-14 Sun 18:16]--[2019-04-14 Sun 19:44] =>  1:28
    CLOCK: [2019-04-12 Fri 20:25]--[2019-04-12 Fri 21:30] =>  1:05
    CLOCK: [2019-04-12 Fri 15:24]--[2019-04-12 Fri 16:32] =>  1:08
    CLOCK: [2019-04-10 Wed 20:25]--[2019-04-10 Wed 21:30] =>  1:05
    CLOCK: [2019-04-09 Tue 19:42]--[2019-04-09 Tue 20:54] =>  1:12
    CLOCK: [2019-04-08 Mon 20:58]--[2019-04-08 Mon 21:42] =>  0:44
    :END:
     - [X] Chapter 8. Code Management and Improvement  ( 5h)
       - Continuous Integration
       - System Administration
       - Speed
     - [X] Chapter 9. Software Interface               ( 3h)
       - Web clients
       - Data Serialization
       - Disributed Systems
       - Cryptography
     - [X] Chapter 10. Data Manipulation               ( 2h)
       - Scientific Applications
       - Text Manipulation and Text Mining
     - [X] Chapter 11. Data Persistence                ( 3h)
       - Structured Files
       - Database Libraries

** bhavin192
*** DONE Cloud Native DevOps with Kubernetes - Part I [11/11]
    CLOSED: [2019-04-18 Thu 22:57]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:   10.67
    :OWNER:    bhavin192
    :ID:       READ.1555009355
    :TASKID:   READ.1555009355
    :END:
    :LOGBOOK:
    CLOCK: [2019-04-18 Thu 22:00]--[2019-04-18 Thu 22:57] =>  0:57
    CLOCK: [2019-04-18 Thu 21:07]--[2019-04-18 Thu 21:52] =>  0:45
    CLOCK: [2019-04-18 Thu 18:35]--[2019-04-18 Thu 19:37] =>  1:02
    CLOCK: [2019-04-17 Wed 21:34]--[2019-04-17 Wed 21:50] =>  0:16
    CLOCK: [2019-04-17 Wed 21:06]--[2019-04-17 Wed 21:30] =>  0:24
    CLOCK: [2019-04-17 Wed 19:31]--[2019-04-17 Wed 20:08] =>  0:37
    CLOCK: [2019-04-17 Wed 18:19]--[2019-04-17 Wed 19:07] =>  0:48
    CLOCK: [2019-04-16 Tue 22:39]--[2019-04-16 Tue 22:50] =>  0:11
    CLOCK: [2019-04-16 Tue 21:31]--[2019-04-16 Tue 22:14] =>  0:43
    CLOCK: [2019-04-16 Tue 21:01]--[2019-04-16 Tue 21:22] =>  0:21
    CLOCK: [2019-04-16 Tue 18:51]--[2019-04-16 Tue 19:57] =>  1:06
    CLOCK: [2019-04-15 Mon 21:27]--[2019-04-15 Mon 22:24] =>  0:57
    CLOCK: [2019-04-15 Mon 21:04]--[2019-04-15 Mon 21:26] =>  0:22
    CLOCK: [2019-04-14 Sun 21:57]--[2019-04-14 Sun 22:37] =>  0:40
    CLOCK: [2019-04-14 Sun 18:51]--[2019-04-14 Sun 19:16] =>  0:25
    CLOCK: [2019-04-14 Sun 18:31]--[2019-04-14 Sun 18:50] =>  0:19
    CLOCK: [2019-04-11 Thu 21:47]--[2019-04-11 Thu 21:59] =>  0:12
    CLOCK: [2019-04-11 Thu 21:17]--[2019-04-11 Thu 21:31] =>  0:14
    CLOCK: [2019-04-11 Thu 19:32]--[2019-04-11 Thu 19:53] =>  0:21
    :END:
    https://www.oreilly.com/library/view/cloud-native-devops/9781492040750/
    - [X] Chapter 1. Revolution in the Cloud               (70m)
      - The Creation of the Cloud
      - The Dawn of DevOps
      - The Coming of Containers
      - Conducting the Container Orchestra
      - Kubernetes
      - Cloud Native
      - The Future of Operations
      - Summary
    - [X] Chapter 2. First Steps with Kubernetes           (40m)
      - Running Your First Container
      - The Demo Application
      - Building a Container
      - Container Registries
      - Hello, Kubernetes
      - Minikube
      - Summary
    - [X] Chapter 3. Getting Kubernetes                    (70m)
      - Cluster Architecture
      - The Costs of Self-Hosting Kubernetes
      - Managed Kubernetes Services
      - Turnkey Kubernetes Solutions
      - Kubernetes Installers
      - Buy or Build: Our Recommendations
      - Clusterless Container Services
      - Summary
    - [X] Chapter 4. Working with Kubernetes Objects       (60m)
      - Deployments
      - Pods
      - ReplicaSets
      - Maintaining Desired State
      - The Kubernetes Scheduler
      - Resource Manifests in YAML Format
      - Helm: A Kubernetes Package Manager
      - Summary
    - [X] Chapter 5. Managing Resources                    (90m)
      - Understanding Resources
      - Managing the Container Life Cycle
      - Using Namespaces
      - Optimizing Cluster Costs
      - Summary
    - [X] Chapter 6. Operating Clusters                    (60m)
      - Cluster Sizing and Scaling
      - Conformance Checking
      - Validation and Auditing
      - Chaos Testing
      - Summary
    - [X] Chapter 7. Kubernetes Power Tools                (80m)
      - Mastering kubectl
      - Working with Resources
      - Working with Containers
      - Contexts and Namespaces
      - Kubernetes Shells and Tools
      - Building Your Own Kubernetes Tools
      - Summary
    - [X] Chapter 8. Running Containers                    (70m)
      - Containers and Pods
      - Container Manifests
      - Container Security
      - Volumes
      - Restart Policies
      - Image Pull Secrets
      - Summary
    - [X] Chapter 9. Managing Pods                         (90m)
      - Labels
      - Node Affinities
      - Pod Affinities and Anti-Affinities
      - Taints and Tolerations
      - Pod Controllers
      - Ingress Resources
      - Istio
      - Envoy
      - Summary
    - [X] Chapter 10. Configuration and Secrets            (70m)
      - ConfigMaps
      - Kubernetes Secrets
      - Secrets Management Strategies
      - Encrypting Secrets with Sops
      - Summary
    - [X] Chapter 11. Security and Backups                 (70m)
      - Access Control and Permissions
      - Security Scanning
      - Backups
      - Monitoring Cluster Status
      - Further Reading
      - Summary
** gandalfdwite
*** DONE Read Kubernetes Docs Part-I [5/5]
    CLOSED: [2019-04-18 Thu 19:59]
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   14.30
   :OWNER: gandalfdwite
   :ID: READ.1553531073
   :TASKID: READ.1553531073
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-18 Thu 18:15]--[2019-04-18 Thu 19:56] =>  1:41
   CLOCK: [2019-04-17 Wed 22:35]--[2019-04-18 Thu 00:26] =>  1:51
   CLOCK: [2019-04-16 Tue 18:26]--[2019-04-16 Tue 20:20] =>  1:54
   CLOCK: [2019-04-15 Mon 19:11]--[2019-04-15 Mon 21:11] =>  2:00
   CLOCK: [2019-04-13 Sat 11:39]--[2019-04-13 Sat 12:43] =>  1:04
   CLOCK: [2019-04-12 Fri 19:42]--[2019-04-12 Fri 20:35] =>  0:53
   CLOCK: [2019-04-12 Fri 15:37]--[2019-04-12 Fri 16:47] =>  1:10
   CLOCK: [2019-04-11 Thu 21:12]--[2019-04-11 Thu 22:36] =>  1:24
   CLOCK: [2019-04-10 Wed 22:16]--[2019-04-10 Wed 22:43] =>  0:27
   CLOCK: [2019-04-09 Tue 22:08]--[2019-04-09 Tue 22:50] =>  0:42
   CLOCK: [2019-04-09 Tue 09:57]--[2019-04-09 Tue 10:31] =>  0:34
   CLOCK: [2019-04-08 Mon 20:04]--[2019-04-08 Mon 20:42] =>  0:38
   :END:
   - [X] Kubernetes Overview                      ( 2h)
   - [X] Kubernetes Architecture                  ( 2h)
   - [X] Containers                               ( 2h)
   - [X] Workloads                                ( 1h)
   - [X] Services, Load Balancing, Networking     ( 3h)
*** DONE Learn dgplug logs [6/6]
    CLOSED: [2019-04-17 Wed 20:21]
   :PROPERTIES:
   :ESTIMATED: 7
   :ACTUAL:   7.60
   :OWNER: gandalfdwite
   :ID: READ.1553605019
   :TASKID: READ.1553605019
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-17 Wed 19:17]--[2019-04-17 Wed 20:21] =>  1:04
   CLOCK: [2019-04-14 Sun 17:58]--[2019-04-14 Sun 18:22] =>  0:24
   CLOCK: [2019-04-14 Sun 09:44]--[2019-04-14 Sun 11:13] =>  1:29
   CLOCK: [2019-04-13 Sat 22:31]--[2019-04-13 Sat 23:29] =>  0:58
   CLOCK: [2019-04-12 Fri 21:23]--[2019-04-12 Fri 22:23] =>  1:00
   CLOCK: [2019-04-11 Thu 18:22]--[2019-04-11 Thu 20:22] =>  2:00
   CLOCK: [2019-04-09 Tue 18:50]--[2019-04-09 Tue 19:31] =>  0:41
   :END:
     - [X] Part 3. Search Functions      ( 1h)
     - [X] Part 4. Shell mode commands   ( 1h)
     - [X] Part 5. Dired mode            ( 1h)
     - [X] Part 6. Info Commands         ( 1h)
     - [X] Part 7. Calculator in emacs   ( 1h)
     - [X] Part 8. Org mode in emacs     ( 2h)
*** IN_PROGRESS Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi) [0/4]
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:   1.82
   :OWNER: gandalfdwite
   :ID: READ.1553531542
   :TASKID: READ.1553531542
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-13 Sat 09:25]--[2019-04-13 Sat 11:14] =>  1:49
   :END:
    - [ ] 1. Introduction                      ( 2h)
    - [ ] 2. Recursion & Backtracking          ( 1h)
    - [ ] 3. Linked Lists                      ( 1h)
    - [ ] 4. Stacks                            ( 1h)
** jasonbraganza
*** IN_PROGRESS NIOS Maths Text Book - Part V [0/7]
   :PROPERTIES:
   :ESTIMATED: 39
   :ACTUAL:   5.95
   :OWNER: jasonbraganza
   :ID: READ.1552291497
   :TASKID: READ.1552291497
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-08 Mon 10:00]--[2019-04-08 Mon 12:53] =>  2:53
   CLOCK: [2019-04-07 Sun 14:44]--[2019-04-07 Sun 16:25] =>  1:41
   CLOCK: [2019-04-07 Sun 11:46]--[2019-04-07 Sun 13:09] =>  1:23
   :END:
    - [-] Module - IV: Co-ordinate Geometry [1/4]
      - [X] 13 - Cartesian System of Rectangular Co-ordinates
      - [ ] 14 - Straight Lines
      - [ ] 15 - Circles
      - [ ] 16 - Conic Sections
    - [ ] Module - V: Statistics and Probability [0/3]
      - [ ] 17 - Measures of Dispersion
      - [ ] 18 - Random Experiments and Events
      - [ ] 19 - Probability
    - [ ] Module - VI: Algebra II [0/3]
      - [ ] 20 - Matrices
      - [ ] 21 - Determinants
      - [ ] 22 - Inverse of a Matrix and its Applications
    - [ ] Module - VII: Relations and Functions [0/2]
      - [ ] 23 - Relations and Functions II
      - [ ] 24 - Inverse Trigonometric Functions
    - [ ] Module - VIII: Calculus [0/8]
      - [ ] 25 -  Limits and Continuity
      - [ ] 26 - Differentiation
      - [ ] 27 - Differentiation of Trigonometric Functions
      - [ ] 28 - Differentiation of Exponential and Logarithmic functions
      - [ ] 29 - Application of Derivatives
      - [ ] 30 - Integration
      - [ ] 31 - Definite Integrals
      - [ ] 32 - Differential Integrals
    - [ ] Module - IX: Vectors and Three Dimensional Geometry [0/4]
      - [ ] 33 - Introduction to Three Dimensional Geometry
      - [ ] 34 - Vectors
      - [ ] 35 - Plane
      - [ ] 36 - Straight Line
    - [ ] Module - X: Linear Programming and Mathematical Reasoning [0/2]
      - [ ] 37 - Linear Programming
      - [ ] 38 - Mathematical Reasoning
** sandeepk
*** IN_PROGRESS Stacknews [2/3]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   6.63
    :OWNER: sandeepk
    :ID: DEV.1552226887
    :TASKID: DEV.1552226887
    :END:
    :LOGBOOK:
    CLOCK: [2019-04-17 Wed 23:15]--[2019-04-18 Thu 00:10] =>  0:55
    CLOCK: [2019-04-17 Wed 08:05]--[2019-04-17 Wed 08:35] =>  0:30
    CLOCK: [2019-04-16 Tue 23:10]--[2019-04-16 Tue 23:50] =>  0:40
    CLOCK: [2019-04-15 Mon 08:05]--[2019-04-15 Mon 08:38] =>  0:33
    CLOCK: [2019-04-13 Sat 16:40]--[2019-04-13 Sat 17:40] =>  1:00
    CLOCK: [2019-04-12 Fri 23:30]--[2019-04-13 Sat 00:00] =>  0:30
    CLOCK: [2019-04-11 Thu 22:55]--[2019-04-11 Thu 23:50] =>  0:55
    CLOCK: [2019-04-09 Tue 23:00]--[2019-04-09 Tue 23:40] =>  0:40
    CLOCK: [2019-04-08 Mon 22:10]--[2019-04-08 Mon 23:05] =>  0:55
    :END:
    - [X] Design/CSS work for the landing page, Login page, Post submit page (5h)
    - [X] Logic for comment on post and tab (2h) 
    - [ ] Logic for thread post linkage (2h)
*** IN_PROGRESS Sapiens Book Reading [4/14]
    :PROPERTIES:
    :ESTIMATED: 6.5
    :ACTUAL:   4.50
    :OWNER: sandeepk
    :ID: READ.1554403369
    :TASKID: READ.1554403369
    :END:
    :LOGBOOK:
    CLOCK: [2019-04-17 Wed 09:00]--[2019-04-17 Wed 09:15] =>  0:15
    CLOCK: [2019-04-16 Tue 08:00]--[2019-04-16 Tue 08:30] =>  0:30
    CLOCK: [2019-04-15 Mon 23:00]--[2019-04-15 Mon 23:30] =>  0:30
    CLOCK: [2019-04-14 Sun 21:10]--[2019-04-14 Sun 21:50] =>  0:40
    CLOCK: [2019-04-14 Sun 13:35]--[2019-04-14 Sun 14:00] =>  0:25
    CLOCK: [2019-04-13 Sat 22:30]--[2019-04-13 Sat 23:20] =>  0:50
    CLOCK: [2019-04-11 Thu 00:15]--[2019-04-11 Thu 00:55] =>  0:40
    CLOCK: [2019-04-08 Mon 23:15]--[2019-04-08 Mon 23:30] =>  0:15
    CLOCK: [2019-04-07 Sun 22:10]--[2019-04-07 Sun 22:25] =>  0:15
    CLOCK: [2019-04-06 Sat 17:10]--[2019-04-06 Sat 17:20] =>  0:10
    :END:
    - [X] History's Biggest Fraud (30m)
    - [X] Building Pyramids (25m)
    - [X] Memory Overload (20m)
    - [X] There is No Justice in History (35m)
    - [ ] The Arrow of History (15m)
    - [ ] The Scent of Money (20m)
    - [ ] Imperial Visions (25m)
    - [ ] The Law of Religion (35m)
    - [ ] The Secret of Success (15m)
    - [ ] The Discovery of Ignorance (35m)
    - [ ] The Marriage of Science and Empire (40m)
    - [ ] The Capitalist Creed (35m)
    - [ ] The Wheels of Industry (30m)
    - [ ] A Permanent Revolution (30m)

** sidntrivedi
*** IN_PROGRESS Learn Javascript [1/5]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:   1.17
   :OWNER: sidntrivedi
   :ID: READ.1554709767
   :TASKID: READ.1554709767
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-09 Tue 10:02]--[2019-04-09 Tue 10:21] =>  0:19
   CLOCK: [2019-04-10 Wed 12:45]--[2019-04-10 Wed 13:21] =>  0:36
   CLOCK: [2019-04-11 Thu 16:20]--[2019-04-11 Thu 16:35] =>  0:15
   :END:
   - [X] ES6
   - [ ] Regular Expressions
   - [ ] Debugging
   - [ ] Basic Data Structures
   - [ ] Basic ALgorithm Scripting
*** TODO Read Linux for you and me [0/4]
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: sidntrivedi
   :ID: READ.1554709804
   :TASKID: READ.1554709804
   :END:
   - [ ] File Permissions
   - [ ] Processes in Linux
   - [ ] Linux Services
   - [ ] Package Management
*** TODO Blog [0/1]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: WRITE.1539072660
    :TASKID: WRITE.1539072660
    :END:      
    - [ ] Write one blog on ES6 features.
